// Check the complete list here: https://bank.gov.ua/NBU_BankInfo/get_data_branch?typ=0&json

const liquidatedBanks = [
  '300012',
  '300120',
  '300131',
  '300142',
  '300175',
  '300205',
  '300272',
  '300852',
  '300885',
  '300896',
  '304706',
  '304988',
  '305880',
  '307394',
  '312248',
  '313009',
  '319092',
  '319111',
  '320627',
  '320702',
  '320735',
  '320854',
  '321712',
  '321767',
  '322302',
  '322465',
  '322799',
  '328210',
  '328384',
  '328760',
  '334594',
  '334828',
  '335946',
  '339038',
  '339072',
  '351629',
  '351931',
  '380054',
  '380236',
  '380292',
  '380322',
  '380355',
  '380377',
  '380388',
  '380399',
  '380418',
  '380474',
  '380537',
  '380612',
  '380764',
  '380816',
  '380935'
]

const validateMFO = (iban: string): true => {
  const mfo = iban.slice(4, 10)
  if (mfo.length !== 6) throw new Error('IBAN номер містить помилки')
  if (liquidatedBanks.includes(iban)) throw new Error('Закодований в IBAN номер МФО належить ліквідованому підрозділу банка')
  return true
}

export default validateMFO
