const vulnerabilities = {
  1: 'одержувач житлової субсидії на придбання скрапленого газу, твердого та рідкого пічного побутового палива',
  2: 'одержувач житлової субсидії на оплату житлово-комунальних послуг',
  3: 'одинока непрацездатна особа пенсійного віку',
  4: 'одинока мати (одинокий батько)',
  5: 'особа, яка отримує допомогу при народженні дитини',
  6: 'багатодітна сім\'я',
  7: 'особа з інвалідністю',
  8: 'cім\'я, яка складається з внутрішньо переміщених осіб',
  9: 'дитячий будинок сімейного типу',
  10: 'прийомна сім\'я',
  11: 'сім\'я патронатного вихователя'
}

export default vulnerabilities
